renesas/rx-driver-package/source/r_qspi_smstr_rx/r_qspi_smstr_rx_vx.xx/r_qspi_smstr_rx/src/targets/rx64m/r_qspi_smstr_target.c
/*******************************************************************************
* Function Name: r_qspi_smstr_trx_disable
* Description  : Disables QSPI transmission and reception.
* Arguments    : channel -
*                    Which channel to use
* Return Value : none
*******************************************************************************/
void r_qspi_smstr_trx_disable(uint8_t channel)
{
    r_qspi_smstr_mpc_disable(channel);              /* MPC : use as general I/O port.                           */
    QSPI_SPCR(channel)  = QSPI_SPCR_INIT;           /* Disable reception.                                       */
    if (QSPI_SPCR_INIT == QSPI_SPCR(channel))
    {
        /* Wait for the write completion. */
        R_BSP_NOP();
    }
    r_qspi_smstr_spsr_clear(channel);               /* Clear status flag of QSPI.                               */
    QSPI_SPSCR(channel) = QSPI_SPSCR_INIT;          /* Initialize sequence length.                              */
    if (QSPI_SPSCR_INIT == QSPI_SPSCR(channel))
    {
        /* Wait for the write completion. */
        R_BSP_NOP();
    }
}


/*******************************************************************************
* Function Name: r_qspi_smstr_tx_enable_dual
* Description  : Enables QSPI transmission in Dual-SPI mode.
* Arguments    : channel -
*                    Which channel to use
*                size -
*                    Size of data
* Return Value : none
*******************************************************************************/
void r_qspi_smstr_tx_enable_dual(uint8_t channel, uint32_t size)
{
    r_qspi_smstr_spsr_clear(channel);               /* Clear status flags of QSPI.                              */
    r_qspi_smstr_buffer_reset(channel);             /* Reset transmit and receive buffer.                       */
    r_qspi_smstr_datasize_set(channel, size);       /* Set data size of transmission for dual or quad.          */
    
    /* ==== Set sequence control and SPI operation mode. ==== */
    if ((QSPI_FIFO_HALF_SIZE <= size) && (0 != (QSPI_FIFO_CHK & size)))
    {
        /* ---- Size of data : (16 * m) + n bytes (m=0x00000001~0x0FFFFFFF, n=0x00000001~0x0000000F) ---- */
        QSPI_SPSCR(channel)     = QSPI_SPSCR_SEQ1;  /* Sequence length = 2                                      */
        QSPI_SPRW0(channel)     = 0;                /* SPCMD0 : Write operation                                 */
        QSPI_SPIMOD0(channel)   = 1;                /* SPCMD0 : Dual-SPI                                        */
        QSPI_SSLKP0(channel)    = 1;                /* Keeps the QSSL signal level from the end of the transfer
                                                       to the beginning of the next access.                     */
        QSPI_SPRW1(channel)     = 0;                /* SPCMD1 : Write operation                                 */
        QSPI_SPIMOD1(channel)   = 1;                /* SPCMD1 : Dual-SPI                                        */
        QSPI_SSLKP1(channel)    = 0;                /* Negate QSSL signal upon completion of transfer.          */
        if (0 == QSPI_SSLKP1(channel))
        {
            /* Wait for the write completion. */
            R_BSP_NOP();
        }
    }
    else
    {
        /* ---- Size of data : (16 * m) bytes or n bytes (m=0x00000001~0x0FFFFFFF, n=0x00000001~0x0000000F) ----*/
        QSPI_SPSCR(channel)     = QSPI_SPSCR_SEQ0;  /* Sequence length = 1                                      */
        QSPI_SPRW0(channel)     = 0;                /* SPCMD0 : Write operation                                 */
        QSPI_SPIMOD0(channel)   = 1;                /* SPCMD0 : Dual-SPI                                        */
        QSPI_SSLKP0(channel)    = 0;                /* Negate QSSL signal upon completion of transfer.          */
        if (0 == QSPI_SSLKP0(channel))
        {
            /* Wait for the write completion. */
            R_BSP_NOP();
        }
    }
    
    r_qspi_smstr_mpc_enable(channel);               /* MPC : use as I/O port for QSPI.                          */
    QSPI_SPCR(channel)  = QSPI_SPCR_TX_DUALQUAD;    /* Enable transmission.                                     */
    if (QSPI_SPCR_TX_DUALQUAD == QSPI_SPCR(channel))
    {
        /* Wait for the write completion. */
        R_BSP_NOP();
    }
}


/*******************************************************************************
* Function Name: r_qspi_smstr_tx_enable_quad
* Description  : Enables QSPI transmission in Quad-SPI mode.
* Arguments    : channel -
*                    Which channel to use
*                size -
*                    Size of data
* Return Value : none
*******************************************************************************/
void r_qspi_smstr_tx_enable_quad(uint8_t channel, uint32_t size)
{
    r_qspi_smstr_spsr_clear(channel);               /* Clear status flags of QSPI.                              */
    r_qspi_smstr_buffer_reset(channel);             /* Reset transmit and receive buffer.                       */
    r_qspi_smstr_datasize_set(channel, size);       /* Set data size of transmission for dual or quad.          */
    
    /* ==== Set sequence control and SPI operation mode. ==== */
    if ((QSPI_FIFO_HALF_SIZE <= size) && (0 != (QSPI_FIFO_CHK & size)))
    {
        /* ---- Size of data : (16 * m) + n bytes (m=0x00000001~0x0FFFFFFF, n=0x00000001~0x0000000F) ---- */
        QSPI_SPSCR(channel)     = QSPI_SPSCR_SEQ1;  /* Sequence length = 2                                      */
        QSPI_SPRW0(channel)     = 0;                /* SPCMD0 : Write operation                                 */
        QSPI_SPIMOD0(channel)   = 2;                /* SPCMD0 : Quad-SPI                                        */
        QSPI_SSLKP0(channel)    = 1;                /* Keeps the QSSL signal level from the end of the transfer
                                                       to the beginning of the next access.                     */
        QSPI_SPRW1(channel)     = 0;                /* SPCMD1 : Write operation                                 */
        QSPI_SPIMOD1(channel)   = 2;                /* SPCMD1 : Quad-SPI                                        */
        QSPI_SSLKP1(channel)    = 0;                /* Negate QSSL signal upon completion of transfer.          */
        if (0 == QSPI_SSLKP1(channel))
        {
            /* Wait for the write completion. */
            R_BSP_NOP();
        }
    }
    else
    {
        /* ---- Size of data : (16 * m) bytes or n bytes (m=0x00000001~0x0FFFFFFF, n=0x00000001~0x0000000F) ----*/
        QSPI_SPSCR(channel)     = QSPI_SPSCR_SEQ0;  /* Sequence length = 1                                      */
        QSPI_SPRW0(channel)     = 0;                /* SPCMD0 : Write operation                                 */
        QSPI_SPIMOD0(channel)   = 2;                /* SPCMD0 : Quad-SPI                                        */
        QSPI_SSLKP0(channel)    = 0;                /* Negate QSSL signal upon completion of transfer.          */
        if (0 == QSPI_SSLKP0(channel))
        {
            /* Wait for the write completion. */
            R_BSP_NOP();
        }
    }
    
    r_qspi_smstr_mpc_enable(channel);               /* MPC : use as I/O port for QSPI.                          */
    QSPI_SPCR(channel)  = QSPI_SPCR_TX_DUALQUAD;    /* Enable transmission.                                     */
    if (QSPI_SPCR_TX_DUALQUAD == QSPI_SPCR(channel))
    {
        /* Wait for the write completion. */
        R_BSP_NOP();
    }
}


