renesas/rx-driver-package/source/r_qspi_smstr_rx/r_qspi_smstr_rx_vx.xx/r_qspi_smstr_rx/src/targets/rx64m/r_qspi_smstr_target.c
/*******************************************************************************
* Function Name: r_qspi_smstr_tx_disable
* Description  : Disables QSPI transmission.
* Arguments    : channel -
*                    Which channel to use
* Return Value : none
*******************************************************************************/
void r_qspi_smstr_tx_disable(uint8_t channel)
{
    r_qspi_smstr_mpc_disable(channel);              /* MPC : use as general I/O port.                           */
    QSPI_SPCR(channel)  = QSPI_SPCR_INIT;           /* Disable transmission.                                    */
    if (QSPI_SPCR_INIT == QSPI_SPCR(channel))
    {
        /* Wait for the write completion. */
        R_BSP_NOP();
    }
    r_qspi_smstr_spsr_clear(channel);               /* Clear status flag of QSPI.                               */
    QSPI_SPSCR(channel) = QSPI_SPSCR_INIT;          /* Initialize sequence length.                              */
    if (QSPI_SPSCR_INIT == QSPI_SPSCR(channel))
    {
        /* Wait for the write completion. */
        R_BSP_NOP();
    }
}


/*******************************************************************************
* Function Name: r_qspi_smstr_rx_enable_dual
* Description  : Enables QSPI reception in Dual-SPI mode.
* Arguments    : channel -
*                    Which channel to use
*                size -
*                    Size of data
* Return Value : none
*******************************************************************************/
void r_qspi_smstr_rx_enable_dual(uint8_t channel, uint32_t size)
{
    r_qspi_smstr_spsr_clear(channel);               /* Clear status flags of QSPI.                              */
    r_qspi_smstr_buffer_reset(channel);             /* Reset transmit and receive buffer.                       */
    r_qspi_smstr_datasize_set(channel, size);       /* Set data size of transmission for dual or quad.          */
    
    /* ==== Set sequence control and SPI operation mode. ==== */
    /* NOTE: When all the commands configuring sequence are dual-/quad-SPI read operations, the sequential operation
             is continued as long as the receive buffer is not empty for the receive data.
             To terminate read operation, execute write operation with transmission buffer empty
             as the last sequence. */
    if ((QSPI_FIFO_HALF_SIZE <= size) && (0 != (QSPI_FIFO_CHK & size)))
    {
        /* ---- Size of data : (16 * m) + n bytes (m=0x00000001~0x0FFFFFFF, n=0x00000001~0x0000000F) ---- */
        QSPI_SPSCR(channel)     = QSPI_SPSCR_SEQ2;  /* Sequence length = 3                                      */
        QSPI_SPRW0(channel)     = 1;                /* SPCMD0 : Read operation                                  */
        QSPI_SPIMOD0(channel)   = 1;                /* SPCMD0 : Dual-SPI                                        */
        QSPI_SSLKP0(channel)    = 1;                /* Keeps the QSSL signal level from the end of the transfer
                                                       to the beginning of the next access.                     */
        QSPI_SPRW1(channel)     = 1;                /* SPCMD1 : Read operation                                  */
        QSPI_SPIMOD1(channel)   = 1;                /* SPCMD1 : Dual-SPI                                        */
        QSPI_SSLKP1(channel)    = 0;                /* Negate QSSL signal upon completion of transfer.          */
        QSPI_SPRW2(channel)     = 0;                /* SPCMD2 : Write operation (To terminate read operation.)  */
        QSPI_SPIMOD2(channel)   = 2;                /* SPCMD2 : Quad-SPI                                        */
        if (0 == QSPI_SPIMOD2(channel))
        {
            /* Wait for the write completion. */
            R_BSP_NOP();
        }
    }
    else
    {
        /* ---- Size of data : (16 * m) bytes or n bytes (m=0x00000001~0x0FFFFFFF, n=0x00000001~0x0000000F) ----*/
        QSPI_SPSCR(channel)     = QSPI_SPSCR_SEQ1;  /* Sequence length = 2                                      */
        QSPI_SPRW0(channel)     = 1;                /* SPCMD0 : Read operation                                  */
        QSPI_SPIMOD0(channel)   = 1;                /* SPCMD0 : Dual-SPI                                        */
        QSPI_SSLKP0(channel)    = 0;                /* Negate QSSL signal upon completion of transfer.          */
        QSPI_SPRW1(channel)     = 0;                /* SPCMD1 : Write operation (To terminate read operation.)  */
        QSPI_SPIMOD1(channel)   = 2;                /* SPCMD1 : Quad-SPI                                        */
        if (0 == QSPI_SPIMOD1(channel))
        {
            /* Wait for the write completion. */
            R_BSP_NOP();
        }
    }

    r_qspi_smstr_mpc_enable(channel);               /* MPC : use as I/O port for QSPI.                          */
    QSPI_SPCR(channel)  = QSPI_SPCR_RX_DUALQUAD;    /* Enable reception.                                        */
    if (QSPI_SPCR_RX_DUALQUAD == QSPI_SPCR(channel))
    {
        /* Wait for the write completion. */
        R_BSP_NOP();
    }
}


/*******************************************************************************
* Function Name: r_qspi_smstr_rx_enable_quad
* Description  : Enables QSPI reception in Quad-SPI mode.
* Arguments    : channel -
*                    Which channel to use
*                size -
*                    Size of data
* Return Value : none
*******************************************************************************/
void r_qspi_smstr_rx_enable_quad(uint8_t channel, uint32_t size)
{
    r_qspi_smstr_spsr_clear(channel);               /* Clear status flags of QSPI.                              */
    r_qspi_smstr_buffer_reset(channel);             /* Reset transmit and receive buffer.                       */
    r_qspi_smstr_datasize_set(channel, size);       /* Set data size of transmission for dual or quad.          */
    
